# SetRenderingSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..SetRenderingSettings Method
View3D Class See Also
---
Changes the rendering settings for this 3d view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetRenderingSettings(
	RenderingSettings settings
)
```

Visual Basic
---
```text
Public Sub SetRenderingSettings ( _
	settings As RenderingSettings _
)
```

Visual C++
---
```text
public:
void SetRenderingSettings(
	RenderingSettings^ settings
)
```

# ### Parameters
settings
    Type: Autodesk.Revit.DB..::..RenderingSettings The new rendering settings to be applied to this view.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
View3D Class
Autodesk.Revit.DB Namespace